app/views/mood_logs/_form.erb

        <datalist id="users_autocomplete">
            <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"

        <datalist id="moods_autocomplete">
            <% Mood.all.each do |mood| %>
---
SELECT "moods".* FROM "moods"

    <%= f.label :rating %>
    <%= f.collection_select :rating_id, Rating.all, :id, :level %>
---
SELECT "ratings".* FROM "ratings"