app/views/moods/show.erb

SELECT "mood_logs".* FROM "mood_logs" WHERE "mood_logs"."mood_id" = ?  [["mood_id", 1]]
---

<% @mood.mood_logs.each do |ml| %>