app/views/users/show.erb

<ul>
    <% @user.mood_logs.each do |ml| %>
---
SELECT "mood_logs".* FROM "mood_logs" WHERE "mood_logs"."user_id" = ?  [["user_id", 17]]