app/controllers/mood_logs_controller.rb

DELETE FROM "mood_logs" WHERE "mood_logs"."id" = ?  [["id", 8]]
---
    def destroy
        mood_log = MoodLog.find(params[:id])
        mood_log.destroy