app/controllers/mood_logs_controller.rb

    def index
        @mood_logs = MoodLog.all.sort_logs
---
SELECT "mood_logs".* FROM "mood_logs"

    def new
        @mood_log = MoodLog.new(flash[:mood_log_attributes])
        @moods = Mood.all.sort_moods
        @users = User.all.sort_users
---
SELECT "moods".* FROM "moods"
SELECT "users".* FROM "users"

    def edit
        @mood_log = MoodLog.find(params[:id])
        @moods = Mood.all.sort_moods
        @users = User.all.sort_users
---
SELECT  "mood_logs".* FROM "mood_logs" WHERE "mood_logs"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "moods".* FROM "moods"
SELECT "users".* FROM "users"

    def create
        mood_log = MoodLog.new(mood_log_params)
        if mood_log.valid?
            mood_log.save
---
INSERT INTO "moods" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Jumpy"], ["created_at", "2019-01-02 03:43:35.301094"], ["updated_at", "2019-01-02 03:43:35.301094"]]
INSERT INTO "mood_logs" ("mood_id", "user_id", "rating_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["mood_id", 15], ["user_id", 15], ["rating_id", 1], ["created_at", "2019-01-03 22:28:46.579477"], ["updated_at", "2019-01-03 22:28:46.579477"]]

    def update
        mood_log = MoodLog.find(params[:id])
        mood_log.update(mood_log_params)
---
SELECT  "mood_logs".* FROM "mood_logs" WHERE "mood_logs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "mood_logs" SET "mood_id" = ?, "updated_at" = ? WHERE "mood_logs"."id" = ?  [["mood_id", 19], ["updated_at", "2019-01-03 23:20:17.586908"], ["id", 5]]

    def destroy
        mood_log = MoodLog.find(params[:id])
        mood_log.destroy
---
SELECT  "mood_logs".* FROM "mood_logs" WHERE "mood_logs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "mood_logs" WHERE "mood_logs"."id" = ?  [["id", 5]]