app/controllers/moods_controller.rb

SELECT "moods".* FROM "moods"
---
    def index
        @moods = Mood.all.sort_moods

SELECT  "moods".* FROM "moods" WHERE "moods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @mood = Mood.find(params[:id])

INSERT INTO "moods" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Frustrated"], ["created_at", "2019-01-03 20:51:40.839749"], ["updated_at", "2019-01-03 20:51:40.839749"]]
---
    def create
        mood = Mood.new(mood_params)
        if mood.valid?
            mood.save

SELECT  "moods".* FROM "moods" WHERE "moods"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
    def edit
        @mood = Mood.find(params[:id])

SELECT  "moods".* FROM "moods" WHERE "moods"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "moods" SET "name" = ?, "updated_at" = ? WHERE "moods"."id" = ?  [["name", "Bubbly"], ["updated_at", "2019-01-04 20:10:28.632227"], ["id", 17]]
---
    def update
        mood = Mood.find(params[:id])
        mood.update(mood_params)