app/controllers/users_controller.rb

    def index
        @users = User.all.sort_users
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def show
        # if session[:user_id]
        #     @user = User.find(session[:user_id])
        #     # flash[:msg] = ["Welcome, #{@user.name}! Log your feelings for today!"]
        # else
        # end
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

    def create
        user = User.new(user_params)
        if user.valid?
            user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "email", "password_digest") VALUES (?, ?, ?, ?, ?)

    def update
        user = User.find(params[:id])
        user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "jacky@flatiron.com"], ["password_digest", "$2a$10$qyR0OAFS77UNgnh/dpPEMOlF0I30SVWbxJteTGf1b.WKPe/CeUlMy"], ["updated_at", "2019-01-04 20:15:33.375915"], ["id", 8]]