app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 14]]
---
    def destroy
        user = User.find(params[:id])
        user.destroy