app/models/mood_log.rb

  def user_name=(name)
    user = User.find_or_create_by(name: name)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Nancy"], ["created_at", "2019-01-02 03:58:30.404313"], ["updated_at", "2019-01-02 03:58:30.404313"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]

  def mood_name=(name)
    mood = Mood.find_or_create_by(name: name)
---
INSERT INTO "moods" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Glorious"], ["created_at", "2019-01-03 23:20:17.427379"], ["updated_at", "2019-01-03 23:20:17.427379"]]
SELECT  "moods".* FROM "moods" WHERE "moods"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]

  def self.sort_logs
    self.all.sort_by{|ml| ml.updated_at}
---
SELECT "mood_logs".* FROM "mood_logs"