app/models/mood.rb

SELECT "moods".* FROM "moods"
---
    def self.sort_moods
        self.all.sort_by{|m| m.name}