app/models/user.rb

SELECT "users".* FROM "users"
---
    def self.sort_users
        self.all.sort_by{|u| u.name}